[
  {
    "id": "cal-2026-02-01",
    "title": "Skoolie morning routine in winter - family edition",
    "platforms": ["tiktok", "instagram"],
    "scheduledDate": "2026-02-03",
    "status": "published",
    "description": "Show the real morning routine with kids in the skoolie during winter. Coffee on the woodstove, condensation wipe-down, bundling up. Keep it cozy and real.",
    "isSponsored": false
  },
  {
    "id": "cal-2026-02-02",
    "title": "GoSun solar oven cooking on the road",
    "platforms": ["tiktok"],
    "scheduledDate": "2026-02-04",
    "status": "published",
    "description": "Demo cooking lunch using the GoSun Sport while parked at a rest stop. Show the setup, cook time, and the kids' reactions to solar-cooked quesadillas.",
    "partnershipId": "partner-003",
    "isSponsored": true
  },
  {
    "id": "cal-2026-02-03",
    "title": "5 things nobody tells you about skoolie life with kids",
    "platforms": ["tiktok", "youtube-shorts"],
    "scheduledDate": "2026-02-06",
    "status": "published",
    "description": "Quick-cut listicle: homeschooling in rest areas, laundromat adventures, the pee bottle situation, finding playgrounds on the road, screen time guilt.",
    "isSponsored": false
  },
  {
    "id": "cal-2026-02-04",
    "title": "Bluetti power station - how we power our skoolie off-grid",
    "platforms": ["instagram"],
    "scheduledDate": "2026-02-11",
    "status": "editing",
    "description": "Instagram Story series: 3 frames showing morning (coffee maker), afternoon (laptops for remote work), evening (movie night for kids). All powered by Bluetti AC200P.",
    "partnershipId": "partner-004",
    "isSponsored": true
  },
  {
    "id": "cal-2026-02-05",
    "title": "Valentine's Day in a skoolie - date night on wheels",
    "platforms": ["instagram", "tiktok", "facebook"],
    "scheduledDate": "2026-02-14",
    "status": "scripting",
    "description": "Fun Valentine's themed content. Setting up a tiny candlelit dinner in the skoolie after kids are asleep. Romantic but real - show the cramped kitchen prep, folding the table out, fairy lights.",
    "isSponsored": false
  },
  {
    "id": "cal-2026-02-06",
    "title": "Skoolie plumbing disaster - keeping it real",
    "platforms": ["tiktok", "youtube-shorts"],
    "scheduledDate": "2026-02-07",
    "status": "published",
    "description": "Our gray water tank froze and cracked. Document the whole repair process. Vanlife isn't always pretty - this is the reality content people love.",
    "isSponsored": false
  },
  {
    "id": "cal-2026-02-07",
    "title": "DIY skoolie insulation upgrade - foam board install",
    "platforms": ["youtube-long"],
    "scheduledDate": "2026-02-15",
    "status": "filming",
    "description": "Full tutorial on adding additional foam board insulation to the skoolie ceiling. Time-lapse the install, explain R-values, show before/after temperature readings. This is the educational long-form content that does well on YouTube.",
    "isSponsored": false
  },
  {
    "id": "cal-2026-02-08",
    "title": "POV: your toddler discovers snow for the first time from a skoolie",
    "platforms": ["tiktok", "instagram", "snapchat"],
    "scheduledDate": "2026-02-10",
    "status": "scheduled",
    "description": "Shot last week at the campground in Flagstaff. Adorable footage of the little one seeing heavy snow through the skoolie window then playing outside. Trending audio.",
    "isSponsored": false
  },
  {
    "id": "cal-2026-02-09",
    "title": "Full skoolie tour - 2026 updated layout",
    "platforms": ["youtube-long", "instagram"],
    "scheduledDate": "2026-02-22",
    "status": "idea",
    "description": "Comprehensive tour video showing all the changes we've made over the last year. Include the new bunk bed setup, improved kitchen, solar panel array, and bathroom renovation. This will also include the Bluetti integration segment.",
    "partnershipId": "partner-004",
    "isSponsored": true
  },
  {
    "id": "cal-2026-02-10",
    "title": "GoSun Instagram Reel - campfire mac & cheese solar edition",
    "platforms": ["instagram"],
    "scheduledDate": "2026-02-18",
    "status": "scripting",
    "description": "Recipe Reel using the GoSun solar oven to make mac & cheese at the campsite. Kids help with prep. Compare cook time to traditional camp stove. Include CTA for affiliate link.",
    "partnershipId": "partner-003",
    "isSponsored": true
  },
  {
    "id": "cal-2026-02-11",
    "title": "Cost breakdown: what we spent on the skoolie conversion",
    "platforms": ["tiktok", "youtube-shorts"],
    "scheduledDate": "2026-02-12",
    "status": "editing",
    "description": "Scrolling text overlay with real numbers. Bus purchase, insulation, electrical, plumbing, interior build, appliances, solar. Total cost reveal at end. These finance/cost videos always pop.",
    "isSponsored": false
  },
  {
    "id": "cal-2026-02-12",
    "title": "Snapchat day-in-the-life vlog",
    "platforms": ["snapchat"],
    "scheduledDate": "2026-02-13",
    "status": "idea",
    "description": "Quick snaps throughout the day. Wake up, drive to new campsite, set up, make lunch, homeschool the kids, sunset hike, campfire dinner. Raw and unedited Snapchat native style.",
    "isSponsored": false
  },
  {
    "id": "cal-2026-02-13",
    "title": "How we make money living in a skoolie (honest breakdown)",
    "platforms": ["tiktok", "instagram", "youtube-shorts"],
    "scheduledDate": "2026-02-20",
    "status": "idea",
    "description": "Transparent income breakdown. Content creation, remote work, seasonal jobs, brand deals. People always ask how we afford this lifestyle. Vulnerability builds trust.",
    "isSponsored": false
  },
  {
    "id": "cal-2026-02-14",
    "title": "Skoolie vs Van vs RV - which is right for your family?",
    "platforms": ["youtube-long", "facebook"],
    "scheduledDate": "2026-02-27",
    "status": "idea",
    "description": "Comparison video drawing from our experience and friends in the vanlife/RV community. Pros and cons of each. Target search traffic for people researching mobile living options.",
    "isSponsored": false
  },
  {
    "id": "cal-2026-02-15",
    "title": "Weekend Snapchat takeover - campground hopping Arizona",
    "platforms": ["snapchat"],
    "scheduledDate": "2026-02-21",
    "status": "idea",
    "description": "Multi-snap series covering our weekend moving between two campgrounds in Arizona. Driving footage, setup at each site, exploring the area. Good for Snapchat's casual, in-the-moment format.",
    "isSponsored": false
  }
]
